Revit 2025 API
PowerFactorStateType Enumeration
 An enumerated type listing all the possible power factor state types for a connector object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum PowerFactorStateType
Public Enumeration PowerFactorStateType
public enum class PowerFactorStateType
type PowerFactorStateType
Members
Member name | Value | Description
Leading | 0 |  Power FactorState Type is Leading.
Lagging | 1 |  Power FactorState Type is Lagging.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace